CSI API ETABS v1

# cFunctionGetNameList Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetNameList(
    	ref int NumberNames,
    	ref string[] MyName,
    	int FuncType = 0
    )

    Function GetNameList (
    	ByRef NumberNames As Integer,
    	ByRef MyName As String(),
    	Optional FuncType As Integer = 0
    ) As Integer

    Dim instance As cFunction
    Dim NumberNames As Integer
    Dim MyName As String()
    Dim FuncType As Integer
    Dim returnValue As Integer

    returnValue = instance.GetNameList(NumberNames,
    	MyName, FuncType)

    int GetNameList(
    	int% NumberNames,
    	array<String^>^% MyName,
    	int FuncType = 0
    )

    abstract GetNameList :
            NumberNames : int byref *
            MyName : string[] byref *
            ?FuncType : int
    (* Defaults:
            let _FuncType = defaultArg FuncType 0
    *)
    -> int

#### Parameters

NumberNames

    Type: SystemInt32

MyName

    Type: SystemString

FuncType (Optional)

    Type: SystemInt32

#### Return Value

Type: Int32

See Also

#### Reference

cFunction Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com